Revit 2024 API
PipingSystem.GetPumpSets Method
 Gets the set of element Id's for all pump sets in the system, if any.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public ISet<ElementId> GetPumpSets()
Visual Basic
Public Function GetPumpSets As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetPumpSets()
Return Value
 The set of all the pump sets in the system.
See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace